results/final/nginx-scx-compare-20260706-120547/run-3/noisy_cgroup_v2_wrk.txt
Running 10s test @ http://127.0.0.1:18082/
  2 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.87ms    1.07ms  22.95ms   88.33%
    Req/Sec     8.34k     2.22k   13.52k    51.00%
  Latency Distribution
     50%    1.47ms
     75%    2.73ms
     90%    2.86ms
     99%    3.94ms
  166426 requests in 10.04s, 29.04MB read
Requests/sec:  16572.81
Transfer/sec:      2.89MB